Autodesk.Revit.DB.BuiltInParameter.ALLOW_MULTIPLE_SELECTION
"Allow Multiple Selection": This is used by the UI to allow selection of multiple elements.

Autodesk.Revit.DB.BuiltInParameter.ELLIPSE_MODIFICATION_KEEPS_RATIO
"Keep Ratio"

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_NODE_CAN_BE_HOSTED
"Can Be Hosted": Specifies of the Analytical Node can be hosted or not.

Autodesk.Revit.DB.BuiltInParameter.ANALYTICAL_NODE_TYPE
"Node Type": Specifies the type of the Analytical Node: hosted or not.

Autodesk.Revit.DB.BuiltInParameter.REBAR_STAGGERED_SET
"Staggered Set"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MAXIMUM_NUMBER
"Maximum Rebar Number"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MINIMUM_NUMBER
"Minimum Rebar Number"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SPLICE_SHIFT_BARS
"Shift Bars"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SPLICE_STAGGER_LENGTH_MULTIPLIER
"Stagger Length Multiplier"

Autodesk.Revit.DB.BuiltInParameter.REBAR_STAGGER_OFFSET_AT_END
"Offset At End"

Autodesk.Revit.DB.BuiltInParameter.REBAR_STAGGER_OFFSET_AT_START
"Offset At Start"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_TYPE_AT_END
"Splice at End"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_TYPE_AT_START
"Splice at Start"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_LAP_LENGTH_AT_END
"Lap Length at End"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_LAP_LENGTH_AT_START
"Lap Length at Start"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_BY_RULES_RUNOUT
"Runout"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_BY_RULES_MIN_LENGTH
"Minimum bar length"

Autodesk.Revit.DB.BuiltInParameter.SPLICE_BY_RULES_MAX_LENGTH
"Maximum bar length"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SPLICE_SPLICE_LINE_POSITION
"Splice Position"

Autodesk.Revit.DB.BuiltInParameter.REBAR_SPLICE_LAP_LENGTH_MULTIPLIER
"Lap Length Multiplier"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_SINGLE_PART_MARK
"Single Part Mark"

Autodesk.Revit.DB.BuiltInParameter.STEEL_ELEM_MARK
"Assembly Mark"

Autodesk.Revit.DB.BuiltInParameter.BENDINGDETAIL_POSITION
"Bending Detail Position"

Autodesk.Revit.DB.BuiltInParameter.TAG_HEAD_ALIGNMENT
"Tag Alignment"

Autodesk.Revit.DB.BuiltInParameter.REBAR_BAR_SPLICE_LENGTHS
"Splice Lengths"

Autodesk.Revit.DB.BuiltInParameter.EXCAVATION_VOLUME_ON_TOPOSOLID
"Excavation Volume on Toposolid"

Autodesk.Revit.DB.BuiltInParameter.TOTAL_EXCAVATION_VOLUME
"Total Excavation Volume"

Autodesk.Revit.DB.BuiltInParameter.EXCAVATION_VOLUME
"Excavation Volume"

Autodesk.Revit.DB.BuiltInParameter.EXCAVATION_ELEMENT_FAMILY_AND_TYPE
"Element Family and Type"

Autodesk.Revit.DB.BuiltInParameter.EXCAVATION_ELEMENT_ID
"Element Id"

Autodesk.Revit.DB.BuiltInParameter.INDIVIDUAL_EXCAVATION_VOLUME
"Individual Excavation Volume"

Autodesk.Revit.DB.BuiltInParameter.TAG_HEAD_POSITION
"Tag Position"

Autodesk.Revit.DB.BuiltInParameter.REBAR_CONSTRAINTS_STATUS
"Rebar Constraint Status"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_FACES_LOCATION
"Picked Faces Location"

Autodesk.Revit.DB.BuiltInParameter.FAMILY_USING_MULTIPLE
"Multiple Join"

Autodesk.Revit.DB.BuiltInParameter.USING_MULTIPLE
"Multiple Join"

Autodesk.Revit.DB.BuiltInParameter.TAG_ORIENTATION_BEHAVIOR
"Tag Orientation"

Autodesk.Revit.DB.BuiltInParameter.FAMILY_NESTING_BEHAVIOR
"Family Nesting Behavior"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SCHEMATIC_HEIGHT
"Height"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_SCHEMATIC_WIDTH
"Width"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_TYPE_TAG_TYPE_ID
"Tag Type"

Autodesk.Revit.DB.BuiltInParameter.BLEND_DEPTH_PARAM
"Depth"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_SEGMENT_REPRESENTATION
"Representation"

Autodesk.Revit.DB.BuiltInParameter.BENDING_DETAIL_REPRESENTATION_FOR_3D_BARS
"View for 3D Shape"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_OFFSET_FROM_SNAPS
"Offset from Snaps"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_ELEVATION_BASE_TYPE
"Elevation Base Type"

Autodesk.Revit.DB.BuiltInParameter.SSE_POINT_ELEVATION
"Elevation"

Autodesk.Revit.DB.BuiltInParameter.TOPOSOLID_SUBDIVIDE_HEIGHT
"Sub-divide Height"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_MAX_CIRCUITS_DATA_PANEL
"Maximum Amount of Circuits"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEC
"Feed Through Lugs Apparent Power Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEB
"Feed Through Lugs Apparent Power Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_FEED_THRU_LUGS_APPARENT_LOAD_PHASEA
"Feed Through Lugs Apparent Power Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEC
"Branch Circuit Apparent Power Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEB
"Branch Circuit Apparent Power Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_BRANCH_CIRCUIT_APPARENT_LOAD_PHASEA
"Branch Circuit Apparent Power Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_DOWNSTREAM_CONNECTED_PHASES
"Downstream Connected Phases"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_SECONDARY_HIGH_LEG_PHASE
"Secondary High-leg Phase"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_HIGH_LEG_PHASE
"High-leg Phase"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_CONNECTED_PHASE
"Connected Phases"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_ANALYTICAL_NUMPHASES
"Number of Phases"

Autodesk.Revit.DB.BuiltInParameter.MEP_SEGMENT_ELEMENT_TYPENAME
"Type Name"

Autodesk.Revit.DB.BuiltInParameter.MEP_SEGMENT_FAMILYNAME
"Family Name"

Autodesk.Revit.DB.BuiltInParameter.MEP_SEGMENT_SYSTEMORSERVICE
"System Type/Service Name"

Autodesk.Revit.DB.BuiltInParameter.MEP_SEGMENT_LENGTH
"Analytical Length"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_ELEC_APPARENT_POWER_RATING
"Apparent Power Rating"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_HYDRAULICLOOP
"Hydraulic Loop"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_CRITICALSEQUENCE
"Critical Sequence"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_HEADERSEGMENT
"Header"

Autodesk.Revit.DB.BuiltInParameter.MEP_ANALYTICAL_NETWORK
"Network Id"

Autodesk.Revit.DB.BuiltInParameter.PIPE_INSULATION_THICKNESS
"Insulation Thickness"

Autodesk.Revit.DB.BuiltInParameter.DUCT_INSULATION_THICKNESS
"Insulation Thickness"

Autodesk.Revit.DB.BuiltInParameter.RBS_REFERENCE_INSULATION_THICKNESS
"Insulation Thickness": This parameter is obsolete. Use DUCT_INSULATION_THICKNESS and PIPE_INSULATION_THICKNESS.

Autodesk.Revit.DB.BuiltInParameter.RBS_DISTRIBUTIONSYS_HL_PHASE_PARAM
"High-leg Phase"

Autodesk.Revit.DB.BuiltInParameter.FABRICATION_MATERIAL_GAUGE
"Material Gauge"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_CURRENT_PHASEC
"Demand Current Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_CURRENT_PHASEB
"Demand Current Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_CURRENT_PHASEA
"Demand Current Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_LOAD_PHASEC
"Demand Apparent Power Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_LOAD_PHASEB
"Demand Apparent Power Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMAND_LOAD_PHASEA
"Demand Apparent Power Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_LOADSUMMARY_DEMAND_LOAD_PARAM
"Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_LOADSUMMARY_CONNECTED_LOAD_PARAM
"Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_SHORT_CIRCUIT_RATING
"Short Circuit Rating Comments"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALESTLOAD_HVAC_PARAM
"HVAC Total Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALLOAD_HVAC_PARAM
"HVAC Total Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALESTLOAD_LIGHT_PARAM
"Lighting Total Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALLOAD_LIGHT_PARAM
"Lighting Total Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALESTLOAD_POWER_PARAM
"Power Total Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALLOAD_POWER_PARAM
"Power Total Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALESTLOAD_OTHER_PARAM
"Other Total Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALLOAD_OTHER_PARAM
"Other Total Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALESTLOAD_PARAM
"Total Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_PANEL_TOTALLOAD_PARAM
"Total Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMANDFACTOR_LOAD_PARAM
"Connected Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_DEMANDFACTOR_DEMANDLOAD_PARAM
"Demand Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASEC
"Apparent Power Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASEB
"Apparent Power Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASEA
"Apparent Power Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASEC
"True Power Phase C"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASEB
"True Power Phase B"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASEA
"True Power Phase A"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASE3
"True Power Phase 3"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASE2
"True Power Phase 2"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD_PHASE1
"True Power Phase 1"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_TRUE_LOAD
"True Power"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASE3
"Apparent Power Phase 3"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASE2
"Apparent Power Phase 2"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD_PHASE1
"Apparent Power Phase 1"

Autodesk.Revit.DB.BuiltInParameter.RBS_ELEC_APPARENT_LOAD
"Apparent Power"

Autodesk.Revit.DB.BuiltInParameter.USE_3D_SNAPPING
"3D Snapping"

Autodesk.Revit.DB.BuiltInParameter.ARC_ELEM_FIX_KEEP_CONCENTRIC
"Keep Concentric"

Autodesk.Revit.DB.BuiltInParameter.WINDOWTYPE_IS_SCHEMATIC
"Schematic"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_SPECIFIC_HEAT_CAPACITY
"Specific Heat Capacity"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_DENSITY
"Density"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_CONDUCTIVITY
"Thermal Conductivity"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_THICKNESS
"Thickness"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_DESCRIPTION
"Description"

Autodesk.Revit.DB.BuiltInParameter.THERMAL_MATERIAL_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.IFC_IMPORT_MATERIAL_NAME
"IFC Material Name"

Autodesk.Revit.DB.BuiltInParameter.LEADER_ORIENTATION
"Orientation"

Autodesk.Revit.DB.BuiltInParameter.LEADER_ANGLE
"Angle"

Autodesk.Revit.DB.BuiltInParameter.LEADER_LENGTH
"Leader Length"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MIN_LENGTH
"Minimum Bar Length"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MAX_LENGTH
"Maximum Bar Length"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MAXIM_SUFFIX
"Maximum Suffix"

Autodesk.Revit.DB.BuiltInParameter.REBAR_MINIM_SUFFIX
"Minimum Suffix"

Autodesk.Revit.DB.BuiltInParameter.ELECTICAL_EQUIP_VOLTAGE
"Voltage Comments"

Autodesk.Revit.DB.BuiltInParameter.ELECTICAL_EQUIP_WATTAGE
"Wattage Comments"

Autodesk.Revit.DB.BuiltInParameter.SHEET_COLLECTION
"Sheet Collection"

Autodesk.Revit.DB.BuiltInParameter.SHEET_COLLECTION_NAME
"Name"

Autodesk.Revit.DB.BuiltInParameter.VIEWER_SHEET_COLLECTION
"Sheet Collection"

Autodesk.Revit.DB.BuiltInParameter.VIEWER_SHEET_NAME
"Sheet Name"

Autodesk.Revit.DB.BuiltInParameter.VIEW_REFERENCING_SHEET_COLLECTION
"Referencing Sheet Collection"

Autodesk.Revit.DB.BuiltInParameter.VIEWPORT_SHEET_COLLECTION
"Sheet Collection"

Autodesk.Revit.DB.BuiltInParameter.EXTRUSION_DEPTH_PARAM
"Depth"

Autodesk.Revit.DB.BuiltInParameter.SCALE_FACTOR_PARAM
"Scale"